地支表 = {
    空:
    {
        名称: '',
        阴阳: '',
        五行: '',        
        属相: '',
        月:'',
        时:'',
        象:[],
        身体:[],
    },
    子:
    {
        名称: '子',
        阴阳: '阳',
        五行: '水',        
        属相: '鼠',
        月:'冬月',
        时:'23~1时',
        象:['湖','海','池','塘'],
        身体:['足少阳胆经','膀胱','尿道','生殖器','阴部','精液','耳朵','月经','血液','汗液'],
    },
    丑:
    {
        名称: '丑',
        阴阳: '阴',
        五行: '土',        
        属相: '牛',
        月:'腊月',
        时:'1~3时',
        象:['园','圃','田','坟'],
        身体:['足厥阴肝经','脾脏','腹部','子宫','阴茎','精囊','嘴唇','皮肤',
            '肚','腹','脾','肌','肉'
        ],
    },
    寅:
    {
        名称: '寅',
        阴阳: '阳',
        五行: '木',        
        属相: '虎',
        月:'正月',
        时:'3~5时',
        象:['山','林','桥','梁'],
        身体:['手太阴肺经','胆','手掌','胡须','左腿','指甲','臂','肢','筋','脉','发','毛','风门穴',
        ],
    },

    卯:
    {
        名称: '卯',
        阴阳: '阴',
        五行: '木',        
        属相: '兔',
        月:'二月',
        时:'5~7时',
        象:['林','木','舟','车'],
        身体:['手阳明大肠经','肝','神经','体毛','手指','筋','胸','目','手','爪','筋'],
    },

    辰:
    {
        名称: '辰',
        阴阳: '阳',
        五行: '土',        
        属相: '龙',
        月:'三月',
        时:'7~9时',
        象:['莹','墓','山','岭'],
        身体:['足阳明胃经','胃','直肠','皮肤','左胸','左肩','左臂','项背','左膝'],
    },


    巳:
    {
        名称: '巳',
        阴阳: '阴',
        五行: '火',        
        属相: '蛇',
        月:'四月',
        时:'9~11时',
        象:['炉','冶','窑','灶'],
        身体:['足太阴脾经','脾','面','口腔','咽喉','牙齿','心肌','肛门','三焦','心胞络'],
    },


    午:
    {
        名称: '午',
        阴阳: '阳',
        五行: '火',        
        属相: '马',
        月:'五月',
        时:'11~13时',
        象:['市','道','旌','旗'],
        身体:['手少阴心经','心','额头','眼睛','肚','脐','神经',
            '心腹','小肠','目','舌','神气'
        ],
    },

    未:
    {
        名称: '未',
        阴阳: '阴',
        五行: '土',        
        属相: '羊',
        月:'六月',
        时:'13~15时',
        象:['村','寨','井','泉'],
        身体:['手太阳小肠经','脊柱','右肩','胃脘','腹腔','小肠','口','手肘','脾','胸','胃','腹','唇','齿'],
    },

    申:
    {
        名称: '申',
        阴阳: '阳',
        五行: '金',        
        属相: '猴',
        月:'七月',
        时:'15~17时',
        象:['驿','铺','石','经'],
        身体:['足太阳膀胱经','大肠','骨骼','肺','右臂','声咳','肺','筋骨','经络','音声'],
    },

    酉:
    {
        名称: '酉',
        阴阳: '阴',
        五行: '金',        
        属相: '鸡',
        月:'八月',
        时:'17~19时',
        象:['岗','城','街','巷'],
        身体:['足少阴肾经','小肠','肺','背骨','精血','鼻','皮毛','声'],
    },

    戌:
    {
        名称: '戌',
        阴阳: '阳',
        五行: '土',        
        属相: '狗',
        月:'九月',
        时:'19~21时',
        象:['田','垄','营','丘'],
        身体:['手厥阴心包经','命门','腰','腿','膝','脚踝','胸','筋','臀','足'],
    },

    亥:
    {
        名称: '亥',
        阴阳: '阴',
        五行: '水',        
        属相: '猪',
        月:'十月',
        时:'21~23时',
        象:['江','河','港','涧'],
        身体:['手少阳三焦','肾','膀胱','阴囊','阴道','分泌物','涌泉穴'],
    },

}



