宫位表 = {
    年干:
    {
        身体:['头部'],
        六亲:['祖上','祖父','父'],
        人际:['长辈','老人','外戚','外人'],
        时空:['一~九岁','远方','海外','边缘','祖上','他人之物'],

    },
    月干: {   
        身体:['胸部'],
        六亲:['父','姐','哥'],
        人际:['领导','老乡','同学','同事'],
        时空:['十九~二十七岁','祖籍','家乡','根','祖产','家业','单位','学业'],
     },
    日干: {    
        身体:['小腹'],
        六亲:['自身'],
        人际:['至亲至近之人'],
        时空:['居所','工作场所','私产','房子','卧室'],
    },
    时干: {    
        身体:['大腿','膝盖','胯'],
        六亲:['长子','长女'],
        人际:['晚辈','下属','朋友','学生','孩子'],
        时空:['四十六~五十四岁','门户','出门','远方','车','门','衣服','帽子','眼镜'],
    },
    大运干: {    
        身体:[],
        六亲:[],
        人际:[],
        时空:[],
    },
    流年干: {    
        身体:[],
        六亲:[],
        人际:[],
        时空:[],
    },
    流月干: {    
        身体:[],
        六亲:[],
        人际:[],
        时空:[],
    },   

    年支: {
        身体:['脖子'],
        六亲:['祖上','祖母','母'],
        人际:['长辈','老人','外戚','外人'],
        时空:['十~十八岁','远方','海外','边缘','祖上','他人之物'],
    },
    月支: {
        身体:['腹部'],
        六亲:['母','弟','妹'],
        人际:['领导','老乡','同学','同事'],
        时空:['廿八~三十六','祖籍','家乡','根','祖产','家业','单位','学业'],
    },
    日支: {
        身体:['小腹'],
        六亲:['男妻','女夫','配偶家族'],
        人际:['至亲至近之人'],
        时空:['三十七~四十五岁','居所','工作场所','私产','房子','卧室'],
    },
    时支: {
        身体:['小腿','脚'],
        六亲:['次子女','三子女'],
        人际:['晚辈','下属','朋友','学生','孩子'],
        时空:['五十五后','门户','出门','远方','车','门','衣服','帽子','眼镜'],
    },
    大运支: {    
        身体:[],
        六亲:[],
        人际:[],
        时空:[],
    },
    流年支: {    
        身体:[],
        六亲:[],
        人际:[],
        时空:[],
    },
    流月支: {    
        身体:[],
        六亲:[],
        人际:[],
        时空:[],
    },

}


