神煞表 = {
    ////神////
    天乙:
    {
        名称: '天乙贵人',
        类型: '神',
        查法: '<p>天乙贵人以年干、或日干为主。实践证明，年干的贵人大，日干的贵人小。贵人以喜神、旺相、生助日元者为佳</p><p>歌诀：甲戊牛庚羊，乙鼠己猴乡，丙猪丁鸡位，壬蛇癸兔藏，六辛逢午马，此是贵人方。</p>',
        介绍: '<p>命中最吉之神，四柱有之遇事有人帮，遇危难之事有人解救，是逢凶化吉之星。</p><p>故天乙贵人，若人遇之则荣，功名早达，官禄易进，如命乘旺气，终将登将相公候方位。</p><p><strong>【男命】</strong>易多，贵人相助。<br><strong>【女命】</strong>不易太多，太多则不利婚姻。</p>',
    },
    福星:
    {
        名称: '福星贵人',
        类型: '神',
        查法: '<p>以八字中的年干或者是日干为主，凡甲丙两干见寅或于，乙癸两干见卯或丑，戊干见申、己干见未，丁干见亥，庚干见午，辛干见已，壬干见辰，即可确定命中带有福星贵人。</p>',
        介绍: '<p>命带福星，一生福禄无缺，格局配合得恰当，必然多福多寿，金玉满堂。平常人得之，也主三餐温饱，无忧无虑。</p><p>此星多主平安福气而不主富贵，全局配合得当，皆可富贵。如果食神为忌，一样贫贱。</p><p><strong>【有口福】</strong>有福之人，吃穿不愁，一般都喜欢各种美食<br><strong>【身材发福】</strong>大多数身材发胖<br><strong>【平安平淡】</strong>没有大起大落，一生平安，遇事逢凶化吉</p>',
    },
    文昌:
    {
        名称: '文昌贵人',
        类型: '神',
        查法: '-/-',
        介绍: '<p>文昌入命，乃才德兼备之人，天生具有文学艺术才会，能兼顾道德、人情、义理，谈吐不俗，仪表文雅。</p><p>命格高者，能成为大文学家、艺术家、学者。命格低者，亦多才多艺。<br>文昌贵人并不是判断一个人升学与否的唯一标准。</p><p><strong>【聪明灵性】</strong>主人聪明，文笔好，记性好，学东西能举一反三，并主秀气，外表斯文，给人一种温文尔雅而谦虚的感觉。<br><strong>【自坐文昌】</strong>如自坐文昌，聪明好学，从小就是天才儿童。<br><strong>【女命】</strong>文昌不易过多</p>',
    },
    国印:
    {
        名称: '国印贵人',
        类型: '神',
        查法: '-/-',
        介绍: '<p>国印者国家权力的象征，中国古代以印表示权力，如印章、掌握国家机构与军队均以帅印为准。<br>国印逢贵人在八字中逢生旺，或有其它吉星相助，不遭逢冲破克害，命主不仅可有掌印之能，亦可为官掌实权。<br>为人很可靠，严守清规，做事公平公正，依章办事，待人待事都很和悦。</p><p><strong>【月柱国印】</strong>家族兄弟姐妹或本人官运亨通<br><strong>【年柱国印】</strong>长辈有官运，本人讲诚信，公平公正，性格和蔼，内心仁慈，有礼节，做事循规蹈矩。</p>',
    },
    太极:
    {
        名称: '太极贵人',
        类型: '神',
        查法: '-/-',
        介绍: '<p>太极者，太初至极之谓。造物之所始，既生不灭，是谓太极。<br>如果又逢生旺或有其他吉星辅助，主其人能福寿双全，不是朝廷做官人，定是人间富贵人。<br>聪明好学，为人正直，有钻劲，做事有始有终，喜天文、地理、哲学，与佛道、宗教有缘。</p><p><strong>【通玄】</strong>命带多个太极贵人会天生对玄学、命格比较感兴趣，而且也很有天分。</p>',
    },
    金舆:
    {
        名称: '金舆星',
        类型: '神',
        查法: '-/-',
        介绍: '<p>金舆为吉星，为华丽之车，是富贵之徵，为高官显贵人所乘之交通工具，遇此之人福最殊，偏主聪明多富贵，性柔貌愿，举止温和，一身清泰无虞。 生日生时遇之为佳。 </p><p>所以，凡有福之人，男的遇之多妻妾，骨肉安泰，子孙茂盛。 女的得之多富贵。 若金舆驿马同位，不仅坐马骑车，更是车来人往，接送频繁，八面威风。</p><p><strong>【男命】</strong>多妻妾、家庭和睦、子孙繁荣<br><strong>【女命】</strong>多富贵<br><strong>【婚配】</strong>财帛之星和配偶相关联，会受到配偶之资助，技术之相助。</p> ',
    },


    禄神:
    {
        名称: '禄神',
        类型: '神',
        查法: '-/-',
        介绍: '<p>禄为养命之源，当得势之时，必能享受成果，所以又称“食禄”、“爵禄”。<br>禄神入命如不被刑冲克破，人缘好，能得到朋友、同事、兄弟姐妹以及同龄人的帮助和照顾。</p><p>即使八字不见财星，但若能见禄神且禄神为用，一样能够荣华富贵。<br>禄神为用，则工作学业能够顺利，能够获得钱财收入，能够健康长寿，是吉祥的象征。<br>禄神遇空或被冲克，则相关的这些方面会有所缺憾，工作学业不顺，破财，生病等。<br>八字身弱而没有印星，则禄神作用很大，此时禄神逢冲则极其危险。</p><p><strong>【禄在年】</strong>为岁禄：祖上福荫，气质高贵，身体健康，自信要强，性急燥，易得罪人，记忆力好，勤劳致富，一生少闲。若逢冲破，主家道中落。身（日主）若太旺，不屑顾祖产，不愿坐享现成之福，自己在外乡独创事业。若逢偏印，即破禄而无禄。<br><strong>【禄在月】</strong>为建禄：性格务实，注重合理、平安的、实用的表现。通常在中年发达，过着稳定的生活，绝大多数会离开故乡任职创业。女性宜当教师。<br><strong>【禄在日】</strong>为专禄：会享受，爱过豪华奢侈的生活。要有羊刃来保护（因禄柔、刃刚），若被合去则无禄，被冲主克配偶。<br><strong>【禄在时】</strong>为归禄：不喜官星，喜羊刃、身旺、财星。不会追求物质享受。逢合变无禄，逢冲，主克子女或寿终。<br><strong>【禄在空亡】</strong>为破禄：财库落空，一生做事只怕是有劳无功，虚名虚利，不足取食。禄神逢冲谓之破禄，如取以为用，又不得吉神解厄，贵人停职剥官，常人衣禄不足。月支建禄被破，贫祖无屋，抛乡离故，奔走他方营谋。大运流年与禄神冲克有凶讯，小则破财，大则严重病灾不免。</p>',
    },

    天官:
    {
        名称: '天官贵人',
        类型: '神',
        查法: '-/-',
        介绍: '<p>又称赐福紫微帝君，是月中赐福之神。<br>命带天官贵人，福禄丰厚，做事易成，如从仕途，则主官运亨通，最适合从事公职。<br>天官贵人以在时支上见到为最佳。</p><p><strong>【日主生旺】</strong>勤奋，公私分明，办事认真，心性不贪，较有始有终，故得上司器重，在职场上较有升迁的机会。<br><strong>【日主衰弱死绝】</strong>为人好高骛远，做起事来三心二意，劳苦奔波，忙碌一生。 </p>',
    },

    天福:
    {
        名称: '天福星',
        类型: '神',
        查法: '-/-',
        介绍: '<p>福德之星，天赐之福。<br>主增加人的通达和地位，且一生很会享乐。<br>又主福寿、名利，主福份为天赐自得。<br>天福为中年后才能发达之星</p>',
    },

    天喜:
    {
        名称: '天喜星',
        类型: '神',
        查法: '-/-',
        介绍: '<p>天喜为婚缘星，次桃花星，命带天喜的人长相俊美，和吉庆的事情有关。待人友善、乐于助人，能够与不同背景和性格的人融洽相处。</p><p><strong>【婚配】</strong>天喜桃花是吉桃花，恋情减少波折，结局美满。在情感方面较为早熟，感情阅历丰富，能够带来良好的异性缘分<br><strong>【财富】</strong>代表财富和吉祥，所以天喜代表财富，尤其是结婚生子后。</p>',
    },

    天厨:
    {
        名称: '天厨贵人',
        类型: '神',
        查法: '-/-',
        介绍: '<p>天厨乃食神建禄之宫，食神是人命福星，食神既能得禄，其福必厚，故谓之天厨。<br>天厨贵人入命，可以享降天之禄、得天赐之福，是一个得福又得禄的吉星。<br>天厨遇空亡，非巫即医。天厨过多容易懒散贪吃。</p><p><strong>【性格】</strong>性格温和，为人厚道，主人品好。<br><strong>【才艺】</strong>口福，厨艺。<br><strong>【富贵】</strong>蒸蒸日上，衣食丰厚，饭局多，工作相对比较清闲。<br><strong>【男命】</strong>工作运较顺，从事食品行业，农业容易取得成功。<br><strong>【年柱】</strong>可得祖荫，少年时期有口福。忌(冲害破空亡衰绝)：祖业无靠，幼时家贫。<br><strong>【月柱】</strong>艺术天赋，善良乐观，自食其力。<br><strong>【日柱】</strong>喜吃喝，做饭，或配偶有品位，对自己事业有帮助。<br><strong>【时柱】</strong>晚年享福，儿孙事业发展不错，孝顺。</p>',
    },


    天德:
    {
        名称: '天德贵人',
        类型: '神',
        查法: '-/-',
        介绍: '<p>乾坤德秀之气，逢凶化吉遇难呈祥之神，其最大的特性是解决灾厄。<br>不容易碰到飞来横祸、盗难、灾劫等，纵然逢之也可以适度足以解决。</p>',
    },

    月德:
    {
        名称: '月德贵人',
        类型: '神',
        查法: '-/-',
        介绍: '<p>逢凶化吉之神，功能与天德略同而稍逊<br>其最大的特点是化解灾厄。其人心地善良，身体健康，人缘好，在生平之中较不会遇到横祸、盗难、灾劫等，纵使逢之也能适时得以化解。</p>',
    },

    天合:
    {
        名称: '天德合',
        类型: '神',
        查法: '-/-',
        介绍: '<p>命带天德合，为人仁慈、敏慧、慈善、温顺、修养高，一生有贵人相助，无险无虑，天德指的是生月三合之气，较为神佛帮助。「德」，就是利物救人、改过迁善。月德贵人其性如同天德贵人、安祥巨福、福寿两全，一生无险无虞。月德指的是人方面，亲朋好友比较会帮助你。<br>天德合在在日柱最好最合适，时柱其次，其它柱福力较差。</p>',
    },

    月合:
    {
        名称: '月德合',
        类型: '神',
        查法: '-/-',
        介绍: '<p>命带月德合，为人善良、乐观和圆融性格使得他们在人际关系中表现出色，并且能够给予他人温暖和支持。他们的存在让周围的人感受到美好和幸福，为他们身边的人带来了积极的影响。</p><p><strong>【年柱】</strong>命主一生好运，能够得到贵人相助，事业平顺有成，且能在社会上能获得很高的名誉地位。<br><strong>【月柱】</strong>命主遇事能够逢凶化吉，十分好运，代表一生福分深厚，健康长寿，不犯官刑，是好运的象征。<br><strong>【日柱】</strong>命主乐善好施，心地十分善良，一辈子都喜欢帮扶他人，广积福德，人缘很好，还能够荫佑后人。<br><strong>【时柱】</strong>命主一生健康运势好，晚年一切都很顺利。衣食无忧，子孙孝顺，能度过一个美满的晚年。</p>',
    },

    华盖:
    {
        名称: '华盖星',
        类型: '神',
        查法: '-/-',
        介绍: '<p>命带华盖星之人，性情怪异，独行特立，天资聪颖，悟性奇高，富于文雅与艺术气质，喜欢神秘事物，经常求神拜佛算命，一般对哲学，宗教，术数，气功等非常感兴趣。<br>命带华盖之人一般不适合做体力劳动者，若为体力劳动者，必多忧愁抑郁。<br>偏爱干净整洁。爱面子，淡名利，故大多数不会在商场上有什么大作为。<br>如走运不顺，多会弃世而去有遁入空门的想法。<br>八字带华盖、食伤、偏印，其人很可能是医卜之人或者作家之类；<br>华盖坐墓享清福（如丙戌日生且戌为华盖)；<br>华盖逢空亡或遭到破坏，则有可能或孤寡，或为僧道之流，或过房入赘，或挟一技而走江湖。<br>八字中带两个以上华盖者，为人处世优柔寡断，往往错失机遇；<br>华盖多逢印绶，并且处于旺相之地，主其人学业有成，在官场有一定的地位；</p><p><strong>【时柱】</strong>可能是过房之子或入赘孤寡之命。<br><strong>【男】</strong>男行华盖运，具有极强说服力，容易在五术（山，医，命，相，卜）上有所建树。<br><strong>【女】</strong>带华盖又带桃花以及贵人，容易成为知名歌星或知名影星；、<br><strong>【女日柱】</strong>日坐华盖对婚姻不利，时带华盖对子女不利；<br><strong>【女运】</strong>女行华盖运，为木兰从军。</p>',
    },

    将星:
    {
        名称: '将星',
        类型: '神',
        查法: '-/-',
        介绍: '<p>将星文武两相宜，禄重权高足可知，将星象征领导干部统御之能力，性主果敢、坚定不移、坚决、临危不惧。</p><p>将星入命：个性果断，才智过人，深具谋略，有领导力，有组织才能，有慑众之威，有权柄威信，有掌权之机，令人敬畏。禄高权重、执掌权力，成女强人，武职胜文职，可掌财政及官政之权，能出任工商高层女主管主职，权力地位高。岁运逢财官，利禄亨通，掌握极大的权力，成为巾帼女英雄，是栋梁之才。</p><p>将星给人权威性不能侵犯的感觉，很自然的释放出某种无形、难以言喻的权威性感，令人一望而生敬畏之心。</p><p>许多当官的人或工商高层负责人八字里边大多数带有将星，所以将星也直接称之为将权，八字带有将星，称为将权入命。<br>凡命带将星，八字中必须正官、七杀或印星有力，将星无破（不被刑、冲、克、害），则其人易在官界显达，可以执掌权柄。即使不掌权，从事其它事业也多有卓越成就。如四柱中无财星及官杀星者，即使有将星也不能入格。</p>',
    },

    日贵:
    {
        名称: '日贵格',
        类型: '神',
        查法: '-/-',
        介绍: '<p>日贵格，寓意命主在而立之年，会因为贵人相助，事业运势从此明朗，人生逐步发生变化，后半生富贵不可言。</p>',
    },

    日德:
    {
        名称: '日德格',
        类型: '神',
        查法: '-/-',
        介绍: '<p>日德格，为人性格慈善，体貌魁梧，有怜贫敬老之心，无毒害刻剥之意。<br>逢凶有救，遇难能解；不遭非横，福必丰厚。<br>有福禄，且寿命长，心态乐观，开心福禄寿而长，属于难得的好命。<br>日德不喜见魁罡，化成煞曜最难当，局中重见须还吉，运至魁罡福不昌。<br>日午德重重免祸殃，官星且忌见财乡，更无冲破空亡处，堪作朝中一栋梁。<br>日德有煞喜身强，不喜财星官旺乡，为性温柔更慈善，一生福寿喜非常。</p>',
    },


    魁罡:
    {
        名称: '魁罡贵人',
        类型: '神',
        查法: '-/-',
        介绍: '<p>魁罡贵人，是制伏众人之星，为偏于男性的吉星，生日逢此聪敏智高，才多学广，但性情刚烈，心高气傲，急燥好胜，行事独断，有掌权立威等特质。女性忌逢。<br>魁罡格需日主健旺，因魁罡格，具有攻击性且格局雄壮，如日主衰弱需印生，与魁罡性格相反，即不成格。<br>如果年柱、月桂、时柱另外有与魁罡相同的干支，则主其人聪明非常，富有果断能力和正义感。<br>综合说来，魁罡人可以掌握莫大的权力；如果日主又强，可以断定他其有勇敢的开拓精神。<br>喜临旺运，遇刑、冲、破、害则败。</p><p><strong>【男】</strong>身强易遇<br><strong>【女】</strong>女性忌逢。如女性逢之无制，主性格暴烈，凌夫伤身。</p>',
    },


    天医:
    {
        名称: '天医贵人',
        类型: '神',
        查法: '-/-',
        介绍: '<p>天医贵人，“天医拱照，可作良医”。命带天医贵人者，大都与医院有缘。</p><p><strong>【吉】</strong>所临地支为八字喜用，且得生旺，命主不但身体健康少病，而且很可能会成为一名医术高明的医生，同时对哲学、心理学或命理学特别感兴趣，有可能会从事这方面的工作。<br><strong>【凶】</strong>所临地支为八字所忌，且被刑冲克害，则命主一生体弱多病，经常会跟医院打交道。</p>',
    },


    天赦:
    {
        名称: '天赦星',
        类型: '神',
        查法: '-/-',
        介绍: '<p>天赦是颗逢凶化吉之星, 能解人霉运. 尤其对犯法之人, 有宽大处理之可能。那说明天赦星就是一个可以解除命主霉运的吉星，让命主处世无忧。就算触犯了法律，也能争取到宽大处理，对有牢狱信息的人尤为有利。命局中有天赦的人，命局的主人必定能够逢凶化吉。</p>',
    },

    金神:
    {
        名称: '金神格',
        类型: '神',
        查法: '-/-',
        介绍: '<p>金神格，勇猛能干，刚毅威严，聪明敏锐，不怒自威，有刚断明敏之才，倔强不驯之志，胆大、好胜、常使人敬而远之，多为武贵。<br>成格条件<br>1.甲日或己日，生于乙丑、己巳、癸酉三时辰；<br>2.原局带阳刃、七杀，尤贵；<br>3.岁运金弱喜扶助，金旺喜见火；<br>4.喜见原局或岁运入火乡，忌水乡。</p>',
    },

    词馆:
    {
        名称: '学堂词馆',
        类型: '神',
        查法: '-/-',
        介绍: '<p>学堂者，如人读书在学堂，故称文星，秀气生发，大都从小就显示岀天资聪颖，成人后更是学业超群，专技精专，文章岀众，一生富贵。<br>主学业功名之事，凡此星入命，主人聪明，可得考职功名，文才出众，登科及第，功名显达。词馆者，如古代翰林院，命中带之，主人学业专精，文章出众，可为教授、学者。</p><p><strong>【吉】</strong>生旺，或临天乙贵人吉星相扶为好。<br><strong>【凶】</strong>克害冲破，才难展，志难伸。</p>',
    },
    进神:
    {
        名称: '进神贵人',
        类型: '神',
        查法: '-/-',
        介绍: '<p>命带“进神”的人，其家庭或者本人很多与佛都有一些缘份，就是本人和现在家庭与佛无关，上几代都会有这方面的信仰或恭俸各类菩萨的习俗。<br>带进神的人一般都会有福、贵之人，特别是八字命局带进神的女性，一般都会嫁入豪门或者嫁入贵族之家，并且也能富贵双全。</p><p><strong>【甲子日柱】</strong>个性纯一、固执，做事脚踏实地，记性好，精于计算。女性外表端庄，体态轻盈，婀娜多姿，不苟言笑，一本正经。甲子日柱生于冬季又为“天赦日”，命主一生福分深厚，遇事总事逢凶化吉，女命多为贵夫人。<br><strong>【甲午日柱】</strong>体格健康，上进心强。命主若生于夏季又为“天赦日”，其人头脑聪明，接受能力强，对文学、艺术的领悟力强，终会出人头地。女性则矜持、自立。<br><strong>【己卯日柱】</strong>爱思考、肯钻研，对自己喜欢的事物会锲而不舍地追求，能发挥潜力，实现理想。容易患脾胃病，食欲不振，或肝胆病引发肋间疼痛。脑神经衰弱、神经质，常作恶梦，在青年期受到挫折，秃唐不振。女性则心境常保持青春气质，讨人喜爱，肯努力上进，不服输，具有独立自主的强烈意念，事业心强，最宜于护士及其他服务性质的行业。<br><strong>【己酉日柱】</strong>凡事循序渐进，由基层开始，一步步往上爬，终能飞黄腾达，不忮不求，平平顺顺。</p>',
    },


    天三奇:
    {
        名称: '天三奇',
        类型: '神',
        查法: '-/-',
        介绍: '<p>通常被认为具有非凡的才华和能力，精神异于常人，吉神三奇贵人(天)',
    },

    地三奇:
    {
        名称: '地三奇',
        类型: '神',
        查法: '-/-',
        介绍: '<p>通常被认为具有非凡的才华和能力，精神异于常人，吉神三奇贵人(地)',
    },

    人三奇:
    {
        名称: '人三奇',
        类型: '神',
        查法: '-/-',
        介绍: '<p>通常被认为具有非凡的才华和能力，精神异于常人，吉神三奇贵人(人)',
    },

    十灵日:
    {
        名称: '十灵日',
        类型: '神',
        查法: '-/-',
        介绍: '<p>逢此日柱出生的人，主灵慧聪明，容易洞悉宗教之星，直觉敏锐，善于察言观色、领悟力、领会力，善解人意等心性皆强。<br>十灵者，聪颖性灵，好诗书文章、时尚杂论等，男子性灵，女子气质佳长相灵秀。<br>直觉敏锐，善于察言观色、善解人意等心性皆强。</p><p><strong>【男命】</strong>男带十灵好文章，男子聪慧，悟性高，高才艺。<br><strong>【女命】</strong>女带十灵好衣裳，女子灵秀俊美，多才艺。<br><strong>【近玄】</strong>很有悟性与灵力，近信仰宗教，对信仰很有见解领悟力。</p>',
    },


    六秀日:
    {
        名称: '六秀日',
        类型: '神',
        查法: '-/-',
        介绍: '<p>文笔卓越之星，求知欲、学习力、思考力等能力皆强，属静态艺术家，如作家、画家、书法家、词曲创作家。</p>',
    },


    ////煞////


    元辰:
    {
        名称: '元辰大耗',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>元辰又名大耗，为命中凶煞，遇到元辰几乎万事不好，人命逢之主动摇不定、内忧外患、立朝有难、居家罹凶、遇吉不免。见凶煞灾异更增，大运旺末尤忌。<br>逢合得当，却可消凶化吉。<br>男命丑陋、是非颠倒、声浊无耻、贪食下流；<br>女命多灾、声雄质混、淫私无礼、生子悖逆。<br>带元辰者，其思维或多或少都会遭到不同程度的破坏，做事在某方面走极端，看不清事物的真面目，分不清是非曲直，难以接受亲友的指点和劝解，尽管失败，自己都不知错在哪里。<br>大运见之，十年可畏；<br>流年见之，一年动摇颠倒；<br>纵有吉星贵人扶持，亦不免福祸参半，喜忧无常。元辰入命的男女，一生最怕情事桃花或酒色之灾，或见无妄之灾，官司、牢狱之灾亦或有之。但是元辰逢合化解，亦多有论富取贵。<br>如果元辰在日住，那么命主可能会对配偶有所不利。元辰与官符并见，会无缘无故受到挫折。带劫煞、灾煞并，则不循细行，动招侮辱，穷贱无耻。妇人得之，声雄性浊，鬼魅为凭，不尊礼法，一生多灾。命带元辰的男女，没有内忧但是必有外患。所以命带元辰的人一定要小心行事。</p>',
    },

    羊刃:
    {
        名称: '羊刃/阳刃',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>羊刃也叫“阳刃”，胆大、勇敢、凶狠、不计后果、不顾面子、占有欲极强，不利父、不利妻等。<br>有“羊刃”的人容易喜欢刀、枪、剑等兵器，喜欢的行业是武装、政法、执法。羊刃喜制伏、克泄，制伏的就为用、为喜，可从事的行业有军人、警察、执法、外科大夫、运动员、武术家等；但是如果羊刃无制伏，则用偏，可能从事非法谋营、匪徒、赌徒、打架斗殴、杀人越货等。</p><p><strong>【身强】</strong>为凶。比如你有钱时，一个很强的兄弟来，假如缺乏适当的制约的话，他会与你争夺，劫你的财。<br>命带卯木羊刃，要注意避免过直与人争斗，避免木器伤害，避免夫妻、家人打架；命带午火羊刃，要注意避免脾气暴躁，酒后失德，也要远离火灾、电力隐患；命带酉金羊刃，要注意远离刀剑、枪械等凶器，避免金属伤害；命带子水羊刃，要注意避免太过放任，桃花满地难以驾驭，也要特别小心交通事故带来伤害。<br><strong>【身弱】</strong>为吉羊刃可以起到很大的匡助作用，比如你贫穷困难时，羊刃就是一个强有力的兄弟，能帮助和支持你。</p>',
    },

    墓煞:
    {
        名称: '墓煞',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>墓煞格，墓煞格又叫七煞入墓、墓中逢鬼或夹持丘，命带此格，主有始无终，骨肉分离，刑妻克子，晚景凄凉。<br>即使命入富贵格局，亦主人生大起大落，骨肉分离，晚景惨淡。如若八字不成富贵格局，<br>日元入墓，或带凶煞，恐为夭折之命。</p>',
    },

    隔角:
    {
        名称: '隔角星',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>凡八字逢隔角煞者，命主六亲缘薄，做事或出外易遭遇困难、阻碍、隔绝等情况，也容易犯口舌、是非，易与人发生纠纷，若再逢刑冲，必有官非诉讼、牢狱之灾。</p>',
    },

    丧门:
    {
        名称: '丧门星',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>丧门星，其含义与披麻，吊客神煞类似，都是代表丧事白事，主死亡哭泣悲哀之事，代表有灾祸之事发生</p><p><strong>【年柱】</strong>刑克自己1-18岁的运势和父母，父母早年宜多病或去世。<br><strong>【月柱】</strong>指本人19~36岁青年运，爱人或家中亲人有灾，很可能危及性命。<br><strong>【日柱】</strong>中年运，易事业不顺，再有流年岁运不利，经常会碰上灾劫横祸发生，而且爱人很可能早夭。<br><strong>【时柱】</strong>晚年失去子女，白发人送黑发人，一生阻逆、波折不断，很难顺遂。</p>',
    },

    吊客:
    {
        名称: '吊客',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>吊客，代表要发生吊丧之事，属于凶煞。行运的时候遇到有吊客的大运流年，则命主很可能会吊丧之事。<br>其含义与披麻，丧门神煞类似，都是代表丧事白事，主死亡哭泣悲哀之事，代表有灾祸之事发生</p><p><strong>【年柱】</strong>刑克自己1-18岁的运势和父母，父母早年宜多病或去世。<br><strong>【月柱】</strong>指本人19~36岁青年运，爱人或家中亲人有灾，很可能危及性命。<br><strong>【日柱】</strong>中年运，易事业不顺，再有流年岁运不利，经常会碰上灾劫横祸发生，而且爱人很可能早夭。<br><strong>【时柱】</strong>晚年失去子女，白发人送黑发人，一生阻逆、波折不断，很难顺遂。</p>',
    },

    披麻:
    {
        名称: '披麻星',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>披麻，代表要发生吊丧之事，属于凶煞。行运的时候遇到有吊客的大运流年，则命主很可能会吊丧之事。<br>其含义与吊客，丧门神煞类似，都是代表丧事白事，主死亡哭泣悲哀之事，代表有灾祸之事发生<br>披麻煞最忌讳在流年或者大运中遇到，如果流年大运伏吟，为凶。<br>如日主强旺，流年或者大运用神得利，命中又有天乙贵人或者月德贵人相助，那么遇见披麻神煞，也不用担心。<br>若果老人身体比较弱，流年或者大运又逢披麻煞，命中用神又被克制，建议在披麻煞流年之前常做体检，<br>婚姻择吉的时候一定要避开披麻煞。</p><p><strong>【年柱】</strong>刑克自己1-18岁的运势和父母，父母早年宜多病或去世。<br><strong>【月柱】</strong>指本人19~36岁青年运，爱人或家中亲人有灾，很可能危及性命。<br><strong>【日柱】</strong>中年运，易事业不顺，再有流年岁运不利，经常会碰上灾劫横祸发生，而且爱人很可能早夭。<br><strong>【时柱】</strong>晚年失去子女，白发人送黑发人，一生阻逆、波折不断，很难顺遂。</p>',
    },

    勾:
    {
        名称: '勾绞',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>命带勾绞煞（破格命），基本性质主凶，如身弱无制，命主易遭飞来横祸，死于非命。<br>一生之中人际关系很不好，与人相处意见很难偕同，容易遭到小人的陷害，经常会有无礼相向的事情发生。<br>命中带之，身旺敌煞，主心灵性巧，执掌刑法律历，若为军中将帅则专行杀戮之职。此煞克身多为不吉，易遭飞灾横祸，死于非命。岁运逢勾绞煞亦主官讼破财等事，命中带七杀为忌，勾绞并会主灾重，此煞凶多吉少。<br>勾绞犯命，对感情婚缘也非常不利，争吵、相害、怨恨等现像是常有的事。流年岁运碰到也一样会犯。<br>如果在大运或者流年中伏吟出现，则容易出现意外伤病等灾祸。</p><p><strong>【日柱】</strong>如与岁运相逢，主伤身破财等灾事。女命日柱有勾绞煞，非常不利于婚姻。</p>',
    },

    绞:
    {
        名称: '勾绞',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>命带勾绞煞（破格命），基本性质主凶，如身弱无制，命主易遭飞来横祸，死于非命。<br>一生之中人际关系很不好，与人相处意见很难偕同，容易遭到小人的陷害，经常会有无礼相向的事情发生。<br>命中带之，身旺敌煞，主心灵性巧，执掌刑法律历，若为军中将帅则专行杀戮之职。此煞克身多为不吉，易遭飞灾横祸，死于非命。岁运逢勾绞煞亦主官讼破财等事，命中带七杀为忌，勾绞并会主灾重，此煞凶多吉少。<br>勾绞犯命，对感情婚缘也非常不利，争吵、相害、怨恨等现像是常有的事。流年岁运碰到也一样会犯。<br>如果在大运或者流年中伏吟出现，则容易出现意外伤病等灾祸。</p><p><strong>【日柱】</strong>如与岁运相逢，主伤身破财等灾事。女命日柱有勾绞煞，非常不利于婚姻。</p>',
    },

    孤辰:
    {
        名称: '孤辰星',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>命带孤辰，缺乏交际能力，兄弟、朋友、婚姻、感情、情谊淡薄，个性孤僻孤独，不易亲近。<br>不喜喧嚷，或频繁社交，喜独自修身养性。<br>固执和孤僻，漂泊不稳定，六亲无依，加煞则容易破相，或者是心里和正常人有些不一样。<br>孤辰，主独立、孤独、固执、自立之星。男命妻绝之地逢孤辰，平生难以婚娶。<br>命中有孤辰、寡宿的人，亲人之间，往往缘分不足；大多出生在单亲家庭，或者父母角色扮演不成功；或者父母不在身边；或者父母感情不和，或者经常吵架；或者长期两地分居。总之，情义不够，互动极少；从少难以得到父母的指导与示范，不懂如何与外界打交道。因此，与人相处，缺乏技巧，也就很少有多少知心朋友。</p><p><strong>【优点】</strong>沉得住气，不易受外界诱惑<br><strong>【性格】</strong>1.处事态度较为消极，为人有点愤世嫉俗，易看别人不顺眼。<br>2.对现状永不满足，批判力强，不合群。<br>3.思想常超越常理而不近情理。<br>4.多半为六亲少靠、白手起家之人。<br>5.一生较漂泊，运势起伏大。</p>',
    },


    寡宿:
    {
        名称: '寡宿星',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>命带寡宿，缺乏交际能力，兄弟、朋友、婚姻、感情、情谊淡薄，个性孤僻孤独，不易亲近。<br>对于感情比较看淡，缺乏一些主动，相比于婚姻，她们往往有其他觉得更高的追求，喜欢胡思乱想，个性沉郁，消极悲观，多愁善感，不利于感情婚姻中的相处，所以女命忌寡宿。<br>一个人如果日坐寡宿，时坐孤辰，而这个寡宿和孤辰又恰好逢空，且又是夫妻星临寡宿孤辰，则婚姻当中的孤独感就会更严重。<br>孤辰寡宿一般容易晚婚，或者异地恋，异地分居，或是分床睡，夫妻之间缺少交流，没有什么共同语言。</p><p><strong>【优点】</strong><br>沉得住气，不易受外界诱惑<br><strong>【性格】</strong><br>1.常自以为是、易看别人不顺眼。<br>2.喜离群索居，寡言，因而易得自闭症。内心矛盾、多疑虑、略带神经质。<br>3.不爱交朋友，喜独来独往，一生知交少之又少。<br>4.心理常有不平衡、欠缺安全感的状况。<br>5.多半为六亲少靠、白手起家之人。一生较漂泊，运势起伏大。</p>',
    },

    地网:
    {
        名称: '地网',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>天罗地网主凶，如在先天命局中出现，或大运、流年中遇之，主有刑罚或牢狱、疾病之灾。</p>',
    },


    天罗:
    {
        名称: '天罗',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>天罗地网主凶，如在先天命局中出现，或大运、流年中遇之，主有刑罚或牢狱、疾病之灾。</p>',
    },

    劫煞:
    {
        名称: '劫煞',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>命带劫煞，一生名利虚浮，做事总是事与愿违，钱财留不住，或是不论怎么努力还是事业不顺，再有流年岁运不利，经常会碰上灾劫横祸发生，而且行为偏激怪异、思绪变的不清，很容易疑神疑鬼。若八字中已有劫煞，又遇元辰、空亡等，命主有偷盗倾向；劫煞与羊刃同柱，命主易遭横祸。</p>',
    },


    亡神:
    {
        名称: '亡神',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>亡神入命为八字凶神者，就像灵魂遭到淹盖，它会让一个正常者变的魂不守舍、有魂无体，做起事来总感觉无精打采，非常不利家运，一生免不了争纷是非，严重者只怕有官司牢狱之灾，易涉足酒色风月场所。</p><p><strong>【入命】</strong>城府多深，做事疑虑。亡神与天乙贵人同现：老谋深算。<br><strong>【为喜】</strong>面有威仪、足智多谋、处事严谨、断事如神，是一个真人不露相者。<br><strong>【凶忌】</strong>其人心性难定、气量狭小、事难如愿、脾气粗俗。<br><strong>【男】</strong>不利妻子儿女<br><strong>【女】</strong>不利夫运又刑伤子女。</p>',
    },

    灾煞:
    {
        名称: '灾煞',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>若日主弱、有劫煞、八字劫煞，则多主钱财破耗，为人心直口快，争强好胜，好管闲事，易生是非口舌，为人不仁，惹是生非，做事有始无终，多灾多难。<br>女性则易招婚姻波折、男人易有灾祸劫厄等。<br>如若年、月、日遇劫煞，主犯刑灾、牢狱。<br>年日逢劫煞，又刑入妻宫，主刑克妻子，婚姻难谐，再遇官符、再遇天煞，则主容易官非牢狱。<br>岁运岁运如果遇劫煞、天煞，表示有官司牢狱之灾。</p><p><strong>【年柱】</strong>幼年时期遭受的惊吓较大。<br><strong>【月柱】</strong>青年时期、婚姻遭遇较多波折。<br><strong>【日柱】</strong>中年时期、身旺时期多有灾险，表现为人生多艰难，家庭与事业多变。<br><strong>【时柱】</strong>老年时期、身体较差时期多有灾险。</p>',
    },

    六厄:
    {
        名称: '六厄',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>劳动得不到领导重视，没有伯乐出现。六厄属剥官之煞，无论官位尺寸，都会有撤职丢官风险。<br>如果有帮扶，逢生旺兼贵族气质相帮则吉，不然一生蹇滞。<br>代表困苦、灾难。如，厄运、困厄。<br>代表受困和阻隔的意思，如阻厄、厄于风雪、厄于风浪等。<br>代表险要的地方，如险厄等。<br>需配合八字格局之喜忌来确定。如果六厄恰为八字命局中所喜用的五行，或者与贵神同柱被强力生旺，则其凶性便大大减弱或得以化解，就无法为祸了。</p>',
    },
    差错:
    {
        名称: '阴阳差错',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>古人云“阳差阴错不风流，花烛迎郎不自由，不是寒房因孝娶，寒房入舍两家愁”，这样所说的就是阴差阳错，而这样的人，在爱情上也都受到了约束，男性娶妻并非自己所秀安的，会是被逼迫的，是在无奈的情况下选择的对方。</p><p><strong>【男】</strong>命中官星不显，忙碌生财，姻缘上也会有很多的阻碍，而且会是有财无库。<br><strong>【女】</strong>难以找到心仪的丈夫的，要么就是对方已经有妻子了，要么就是对方并不是真心爱自己的人，很容易早婚克夫，或者是很容易离婚。</p>',
    },

    九丑:
    {
        名称: '九丑日',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>九丑坐命，感情多有争端，为人多情，日干自坐桃花，是自己和配偶均是情欲较重的表现。<br>多婚外情或是畸情恋曲的发生，或者难以启齿的事情，故婚姻难以顺利。</p><p><strong>【男】</strong>短寿，不得善终。<br><strong>【女】</strong>防产厄。</p>',
    },

    四废:
    {
        名称: '四废日',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>四废日，就是指在春、夏、秋、冬这四个季节里，能量最弱的日子，因此能量最弱，处于废亡状态。<br>命局中出现四废，必定体质虚弱。<br>体弱的人通常体虚乏力，意志力欠佳，所以做事易于半途而废，有头无尾，所以命有四废的人做事往往多败少成。<br>要是没有生扶之星出现，又遭受凶煞克制欺害，则主其人会身患伤残。或是是因官司口舌，而遭遇牢狱之灾。<br>或是是出家的僧道之命。在现实中，命带四废的命主，机遇不好，做事尤其难有成就，尤其有做什么事都使不上劲的感觉。</p>',
    },


    天转:
    {
        名称: '天转',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>天转地转是指在四季中，八个五行能量过旺的日子。<br>人若在这些天里出生，容易出现夭折，难以长大成人等情况。<br>天地杀日最忌上官受职，出行商贾、造作、嫁娶、必主凶，命在此日，必主夭折。</p>',
    },


    地转:
    {
        名称: '地转',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>天转地转是指在四季中，八个五行能量过旺的日子。<br>人若在这些天里出生，容易出现夭折，难以长大成人等情况。<br>天地杀日最忌上官受职，出行商贾、造作、嫁娶、必主凶，命在此日，必主夭折。</p>',
    },

    五鬼:
    {
        名称: '五鬼',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>主破财、人口不安、疾病、死亡的凶煞，五鬼在命理中称之为五鬼官符，犯五鬼官符者，运势下坡招小人。</p><p><strong>【日柱】</strong>容易得到偏财，但是同时也较易惹上小人、是非和灾害等。</p>',
    },

    八专:
    {
        名称: '八专',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>八专入命的人，大都比较多情，很容易在平常的相处之中即让自己不知不觉而陷入感情漩涡，很多畸情的发生未必命带桃花，八专入命的男女也经常会有情事生忧的困扰。古人论命视八专为桃花的一种，因为命带八专的人容易发生不为人知的恋情产生。<br>八专入命：感情多有争端，六亲冷淡，刑克夫妻。</p><p><strong>【男】</strong>为忌神，多淫乱，娶不正之妻。<br><strong>【女】</strong>为忌神，不择亲疏多交。</p>',
    },

    孤鸾:
    {
        名称: '孤鸾',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>命犯孤鸾煞，主婚姻不顺。</p><p><strong>【男】</strong>多暴烈、气盛，高傲，刚强不服输，欠缺温柔，说话理据十足，自傲而不听妻言，骂妻且不留情面，家庭多见暴力，妻子身体易见伤痕。难享妻福，难得到妻子的全力庇荫与照顾。伤妻，夫妻多纷争，外遇外见，生活孤立，作事独立自主，婚姻不顺，难得良妇，重妻再娶。<br><strong>【女】</strong>高傲不驯，舌尖嘴利，口齿伶俐，说话理据十足，欠缺温柔，伤夫，巾帼不让须眉之相，自傲而不听夫言，骂夫且不留情面。常存外鹜之情，夫妻多纷争，多波折，克夫再嫁，婚姻不顺，守寡难得良缘，多为晚婚。</p>',
    },


    飞刃:
    {
        名称: '飞刃',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>飞刃入命宫，主对健康不利。自己易有血光事，易受伤，亦主身出死疾，小儿则易体弱多病，不伤己则伤人，如是操刀为业者无妨。</p><p><strong>【临财】</strong>男为克妻，妻子易出血光事，身体易伤，否则此年有破财事 。<br><strong>【临官】</strong>若女命为丈夫易出血光事，身体易伤，否则此年事业出灾之象。<br><strong>【临父母】</strong>有克父母，易导致父母得病受伤，此为克父母之象，可认命硬之人为干爹，以散其祸。<br><strong>【临福德】</strong>与其它煞相配合有自残之象。<br><strong>【临夫妻】</strong>夫妻时常不合，主争吵打闹之事。<br><strong>【日柱】</strong>主命途多舛，意外状况较多。<br><strong>【时柱】</strong>易有意外凶险，主人容易遭遇突如意外和急速的大磨难和凶险。</p>',
    },

    天狗:
    {
        名称: '天狗',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>有血光、伤害、破相、生命危害等，命犯天狗者，有流年逢之会危害到生命安全<br>小孩易有颜面伤害破相。</p>',
    },

    红艳:
    {
        名称: '红艳',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>气质出众，有特殊的魅力与好人缘，以至于本人在爱情追求上如虎添翼。<br>风流多情，好色，女命犯之尤为不宜，贞操观念淡薄，容易有外遇，或婚前失贞等事发生。</p><p><strong>【女】</strong>地支有日干得禄，又带驿马，为人放荡多情，有沦娼妓之可能，生长在富贵家中的妇女，亦有这种现象。</p>',
    },

    沐浴:
    {
        名称: '沐浴',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>带沐浴者往往是一个独立自主的命运；多见少小离家、劳苦多见。职业易起变化。一生多见桃色纠纷，容易为情所困。<br>个性较为固执己见，做事有欠始终，以致于容易造成孤立。具有艺术气息，但容易有喜新厌旧情形。</p><p><strong>【年柱】</strong>父母之间可能有不能和睦相处情形发生。<br><strong>【月柱】</strong>中年之前，事业常起变化，人生多见波澜。<br><strong>【日柱】</strong>早年辛苦，中晚年安祥。<br><strong>【时柱】</strong>子女缘分较薄。</p>',
    },

    桃花:
    {
        名称: '桃花',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>命犯桃花煞者，不论男女，皆色欲极重，还会因桃色事件引来灾祸，容易陷入感情纠纷，如被人敲诈勒索，身染重疾等。而酒色财气，犯此煞者多半酒色不分家，长期以往，身体被掏空榨干。</p><p><strong>【比肩桃花】</strong>容易获得同辈人的青睐，敢爱敢恨，相处起来地位平等，不存在谁比谁多付出许多。<br><strong>【劫财桃花】</strong>同比肩，但性质会更凶一些。身弱的八字遇到劫财没有问题，如果身旺，又遇到劫财桃花，要小心情色带来的破财等凶事。<br><strong>【食神桃花】</strong>容易喜新厌旧，感情游移不定。丰富的情感，也容易让人变得不切实际爱幻想。吃喝玩乐过后，剩下的都是空虚。<br><strong>【伤官桃花】</strong>伤官为艺术、才能，为情欲。口才出众，恃才傲物。交往激情热烈。好的时候你侬我侬，掰的时候也是恶语相向。伤官泄身，不要因为沉迷于酒色而伤身破财。<br><strong>【正财桃花】</strong>自身的异性缘好，另一半大概率会很漂亮。<br><strong>【偏财桃花】</strong>豪爽豪迈，肯花钱。为喜用，都因桃花给自己带来收益。身弱不担财，饮酒色而破财招灾就在所难免。<br><strong>【正官桃花】</strong>正直善良，自我约束力强，知法懂礼，有自制力。你们往往相遇在比较正式的场合，可能是与你有工作往来的人。女命正官为夫，老公一表人才。同时，由于老公长得帅，所以他的桃花也是不断。<br><strong>【七杀桃花】</strong>“桃花煞”指的就是七杀桃花。七杀为忌的情况下，八字原局有七杀桃花，流年大运再来七杀桃花，很有可能会因情招惹无妄之灾。尤其是女生，七杀桃花可能是对你穷追不舍，给你造成困扰的那一类，再严重可能会遭到欺辱，它无法好聚好散，他的行为也不以你的意志为转移。<br><strong>【正印桃花】</strong>可能是年龄比你大，是个温柔体贴，对你关怀备至的人。为人清高淡雅，默默奉献，对你的付出是不求回报的，满满的安全感。<br><strong>【偏印桃花】</strong>会吸引到一些个性偏内向孤僻，内心爱的热烈，却羞于表达的人。他们往往有着很高的创造力和艺术表现力，有些孤芳自赏，注重思想上的共鸣与交流，用自己喜欢的方式追求你，不管是不是你想要的，所以难免显得有些自私。</p>',
    },

    咸池:
    {
        名称: '咸池',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>咸池，又名桃花煞，主性欲。它主要是对一个人的情感，魅力和恋爱，婚姻生活有影响，附带还有隐秘，酒水之类的影响。还主聪明，风流倜傥，异性缘佳。处于生旺之地，主人姿容貌美。</p><p><strong>【男】</strong>生旺，慷慨好交游，喜欢美色。<br><strong>【女】</strong>生旺，风情万种，美丽诱人。</p>',
    },

    红鸾:
    {
        名称: '红鸾',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>红鸾原是天喜星，入命吉兆，主婚姻喜庆。红鸾星在命，主聪明、温和秀丽、婚姻早发；天喜星在命，主容貌俊美<br>通常认为这个人在感情上会有好的发展，可能会遇到理想的伴侣，或是婚姻生活幸福美满。</p>',
    },

    驿马:
    {
        名称: '驿马',
        类型: '煞',
        查法: '-/-',
        介绍: '<p>驿马主奔波、走动、外出、旅行、出差、搬家、转职等与移动有关的事象，命有有驿马，一生多动，不停奔波，很难安定下来。驿马主要作用是让命主在人生中经历更多的变化和机遇，也代表着事业、财运等方面的发展</p><p><strong>【多个驿马】</strong>则主心意不定，见异思迁，一生不安，东奔西走，飘泊无定，万分辛劳。<br><strong>【驿马受冲】</strong>比如申为驿马，又有寅字，寅申相冲，一生动得最为厉害。小孩八字有驿马逢冲，可能有小儿多动症。<br><strong>【大运流年】</strong>为“驿马运”，主该运或该年事业、环境有所变动，或外出时间较长，比如有出差、旅行、调整或变换工作等事。<br><strong>【女】</strong>不喜八字有驿马，更不喜驿马逢冲，如果有了二个或二个以上的驿马，或者驿马逢冲，乃不吉之兆，一生操劳，社交活动多，在外奔波多，心意不定，并有可能红杏出墙。<br><strong>【男】</strong>八字驿马坐正财，表明老婆勤快，在家肯做事，同时也表示可能会娶远方之妻，或妻子有奔波。如果日干旺，比劫多，比劫坐驿马，与兄弟姐妹各在一方。<br><strong>【喜用】</strong>则迁动主吉<br><strong>【忌凶】</strong>则迁动主凶。<br><strong>【空亡】</strong>马落空亡，终身奔走，劳而少成。经云：马落空亡，乃操心落魄之人。<br><strong>【临印】</strong>印星代表文书、房屋、车、母亲等，必为此而动。<br><strong>【临财】</strong>财星代表求财、女人、供销等沙，必为此事而动。<br><strong>【临食伤】</strong>食伤代表欲望、投资，子女、求财、考察等事。<br><strong>【临官杀】</strong>代表工作，官司、公事、出差等。<br><strong>【临比劫】</strong>代表兄弟、朋友、帮助别人、合伙求财等事奔波。<br><strong>【临桃花】</strong>是为女人、情人、艳事所动。<br><strong>【临华盖】</strong>是为神秘、学习之事所动。<br><strong>【年柱】</strong>是为长辈、父母之事所动。<br><strong>【月柱】</strong>兄弟、朋友，同辈之事所动。<br><strong>【日柱】</strong>为自己事，妻子事，岳父母家事所动。<br><strong>【时柱】</strong>是为子女，小辈之事所动。</p>',
    },


}
