天干表 = {
    空:
    {
        综合:[],
        性:[],
        象:[],
        身体:[],
        年:[],
        月:[],
        日:[],
        时:[]
    },
    甲:
    {
        综合:['甲','阳','木','一','东方','栋梁之木','在天为雷','在地为树','在人为首领'],
        性:['宽仁','磊落','卓立','高贵','第一','顶级的','其形为【直】'],
        象:['雷','大树','首领','树林','木头','栋梁','电杆','高楼','神位','公门'],
        身体:['胆','头','面','发','眉','臂','肢体','经脉','神经','肩','足'],
        年:['头','胆'],
        月:['肝胆','上肢'],
        日:['大腿骨'],
        时:['下肢','小腿骨','足']
    },
    乙: {    
        综合:['乙','寅','木','二','东方','花果之木','藤蔓之木','在天为风','在地为禾'],
        性:['朴实','善良','柔情','儒雅','仁慈','其形为【曲】'],
        象:['风','山林','苗','乔木','藤条','手作','庄稼','绿地','花园','毛笔','织物','丝线'],
        身体:['肝','头发','颈','神经'],
        年:['头','颈项'],
        月:['肝','上肢'],
        日:['肝','胆','胯'],
        时:['腿','脚','筋','神经','关节']
    },
    丙: {    
        综合:['丙','阳','火','三','南方','光焰之火','在天为日','在地为光','太阳之火'],
        性:['广博体恤','正面','多言','激情','心思','其形为【大】'],
        象:['太阳','帝王','权力','温暖','色彩','传媒','名气','花','靓丽','书画','演说','电','电器'],
        身体:['小肠','眼睛','神经','大脑','血压','肩','额头','心脑血管'],
        年:['脑神经','眼目'],
        月:['肩部','胸部'],
        日:['小肠','阑尾'],
        时:['腿脚神经系统']
    },
    丁: {   
        综合:['丁','阴','火','四','南方','灯烛之火','在天为星','在地为灯'],
        性:['文雅','多思','神秘','智慧','其形【小】'],
        象:['星光','灵光','灯烛','文化','文学','思想','医道','玄学','神学','香火','内心','电子','网络','书报','荣誉','名望 '],
        身体:['心','眼睛','心脏','血液','神经','牙齿','体温'],
        年:['脑神经','眼目'],
        月:['心脏','血液系统'],
        日:['跨部血液系统'],
        时:['腿部血液系统']
     },
    戊: {    
        综合:['戊','阳','土','五','中位','戊为城墙','高岗之土','在天为霞','在地为土'],
        性:['忠厚','慢性子','老成生硬','固重','富诚信','个性沉稳忠厚','重名誉','生活方式古板而劳碌','其形为【方】'],
        象:['大地','空地','大建筑','霞','山丘','城池','政府','房地产','仓库','停车场','寺院','古董','旧物','涂料','藏品','凸起物'],
        身体:['胃','鼻','皮肤','肌肉','乳房','腹部','肋','肿块','肋胁','背','肺'],
        年:['脑神经','鼻','面'],
        月:['肋','胸肌','上臂肌肉'],
        日:['胃','腹肌','消化系统'],
        时:['腿部肌肉']
    },
    己: {    
        综合:['己','阴','土','六','中位','田园之土','平原之土','在天为云','在地为土'],
        性:['含蓄','谨慎','多疑','其形为【平】'],
        象:['自我','小空地','田','庭院','房屋','墓地','平原','农业','水泥','建材','装饰','果实','书','通道','粉尘','脏','斑点'],
        身体:['脾','腹','皮肤','胰腺','口腔','增生之物'],
        年:['颈','颈椎','面皮肤肌肉'],
        月:['脾','胸肌','上臂肌肉'],
        日:['腹','腹肌','腰肌'],
        时:['腿肌肉']
    },
    庚: {    
        综合:['庚','阳','金','七','西方','斧钺之金','在天为清冷肃杀','在地为铮铮铁骨'],
        性:['刚强','威武','暴躁','固执','其形为【棱角】'],
        象:['霜','大金属','铁器','利器','五金','钢材','机器','金融','军队','警察','车','大路','制造业 ','矿物',' 手术 医院'],
        身体:['前列腺','大肠','大骨骼','肺','牙齿','嗓音','脐','肋骨'],
        年:['头骨','牙齿'],
        月:['胸骨','上臂骨胳经络'],
        日:['脐轮','尾骨','大肠'],
        时:['下肢骨胳经络']
    },
    辛: {
        综合:['辛','阴','金','八','西方','首饰之金','在天为月','在地为金'],
        性:['通达','柔润','灵动','好面子','其形为【致密】'],
        象:['月','金子','珠宝','玉器','钻石','金饰品','晶体','乐器','针','剪刀','笔','钱币','金融','医药','精加工','法律'],
        身体:['肺','鼻子','呼吸系统','牙齿','小肠','股'],
        年:['牙','喉','呼吸道','淋巴'],
        月:['肺','胸骨','胸腔','淋巴'],
        日:['腹骨','股骨'],
        时:['腿骨','关节']
    },
    壬: {    
        综合:['壬','阳','水','九','北方','江河之水','在天为云海','在地为江河湖海'],
        性:['智谋','好动','任性','性质流动','游离态的水','其形为【无规则】'],
        象:['云海','大海','水泽','江河','湖泊','航运','运输','贸易','水产','浴业','石油','水彩','运算','数'],
        身体:['膀胱','三焦',,'动脉','膀胱','大腿','大痣','血液','脑','骨髓','泌尿系统','腋下'],
        年:['嘴','口','舌','耳','脑供血'],
        月:['心脏供血系统','肺液'],
        日:['三焦','膀胱','泌尿系统'],
        时:['腿部']
    },
    癸: {    
        综合:['癸','阴','水','十','北方','雨露之水','在天为雨','在地为泉'],
        性:['智谋','聪明','机敏','温柔','小溪杯中之水有秀气','其形为【圆润】'],
        象:['泉水','雨露','霜雪','池塘','结晶','眼泪','墨','水产','球','浴业','后面','玄学','下水道','谋略','美容','提纯物','药'],
        身体:['肾','心包','骨髓','脑','精液','经血','津液','足','颈椎'],
        年:['脑供血系统'],
        月:['心包络'],
        日:['肾','泌尿','生殖系统'],
        时:['足部']
        
    },


}
